app/Models/CompteModel.php

            'isDirecteur' => TRUE,
        ];

        $getDirecteurIfExist = $this->where('email', 'directeur@gmail.com')->first();
---
SELECT *
FROM "Compte"
WHERE "email" = 'directeur@gmail.com'
 LIMIT 1

    public function get_all(){
        return $this->orderBy('id_utilisateur')->findAll();
---
SELECT *
FROM "Compte"
ORDER BY "id_utilisateur"