app/Models/EtudiantModel.php

SELECT *
FROM "Etudiant"
ORDER BY "id_etudiant"
---



        if(empty($this->orderBy('id_etudiant')->findAll())){

SELECT *
FROM "Etudiant"
ORDER BY "id_etudiant"
---
    public function get_all(){
        return $this->orderBy('id_etudiant')->findAll();