app/Models/RattrapageModel.php

    public function get_all(){

        return $this->orderBy('id_rattrapage')->findAll();
---
SELECT *
FROM "Rattrapage"
ORDER BY "id_rattrapage"

    public function get($id){

        return $this->where('id_rattrapage', $id)->first();
---
SELECT *
FROM "Rattrapage"
WHERE "id_rattrapage" = '2'
 LIMIT 1

    public function majDirecteur()
    {
        $request = \Config\Services::request();

        $etudiantsJustifie='{}';
        $etudiantsNonJustifie='{}';

        if ($request->getPost('etudiantsJustifie') !=null)
            $etudiantsJustifie = '{'.implode(',',$request->getPost('etudiantsJustifie')).'}';
        if ($request->getPost('etudiantsNonJustifie') !=null)
            $etudiantsNonJustifie = '{'.implode(',',$request->getPost('etudiantsNonJustifie')).'}';

        $data = [
            'nom' => $request->getPost('nom'),
            'ressource' => $request->getPost('ressource'),
            'semestre' => $request->getPost('semestre'),
            'enseignant' => $request->getPost('enseignant'),
            'type' => $request->getPost('type'),
            'dateDS' => $request->getPost('dateDS'),
            'duree' => $request->getPost('duree'),
            'etudiantsJustifie' => $etudiantsJustifie,
            'etudiantsNonJustifie' => $etudiantsNonJustifie,
        ];
        $this->where('id_rattrapage', $request->getPost('id_rattrapage'))->set($data)->update();
---
UPDATE "Rattrapage" SET "nom" = 'DS dev', "ressource" = 'R1.01 Initiation au développement', "semestre" = '2', "enseignant" = '1', "type" = 'Devoir Machine', "dateDS" = '2024-02-01 15:00:00', "duree" = '2h', "etudiantsJustifie" = '{}', "etudiantsNonJustifie" = '{1,2,3,4,5,6}'
WHERE "id_rattrapage" = '2 '