app/Models/RessourceModel.php

SELECT *
FROM "Ressource"
ORDER BY "id_ressource"
---

        }

        if(empty($this->orderBy('id_ressource')->findAll())){

SELECT *
FROM "Ressource"
ORDER BY "id_ressource"
---
    public function get_all(){
        return $this->orderBy('id_ressource')->findAll();